Repository: henzfdev/HC-Player
Catalog: HC Player/Strings/*/Resources.resw
Source language: en_us
Languages: pt_br

# SettingsMediaBadgeIndividualDescription.Text
source: file name defines the badge and theme
pt_br: Nome do arquivo define a badge e o tema

# SettingsMediaBadgeVariantLabel.Text
source: Variant
pt_br: Variante

# SettingsMediaBadgeVariantBoth.Content
source: Both themes
pt_br: Ambos os temas

# SettingsMediaBadgeVariantDark.Content
source: Dark theme
pt_br: Tema escuro

# SettingsMediaBadgeVariantLight.Content
source: Light theme
pt_br: Tema claro

# SettingsMediaBadgeIndividualImportButton.Text
source: Import image…
pt_br: Importar imagem…

# SettingsMediaBadgeIndividualRemoveButton.Text
source: Remove
pt_br: Remover

# SettingsMediaBadgeIndividualStatus.Text
source: Used only for the theme indicated by the name
pt_br: Usada apenas no tema indicado pelo nome

# MediaBadgeFilePickerTitle
source: Select badge image
pt_br: Selecionar imagem da badge

# MediaBadgeImageFilter
source: Badge images (*.png;*.svg)
pt_br: Imagens de badge (*.png;*.svg)

# MediaBadgeIndividualImportFailed
source: The selected badge could not be imported
pt_br: Não foi possível importar a badge selecionada

# MediaBadgeIndividualImportedBoth
source: Badge imported for both light and dark themes
pt_br: Badge importada para os temas claro e escuro

# MediaBadgeIndividualImportedOne
source: Badge imported for the selected variant
pt_br: Badge importada para a variante selecionada

# MediaBadgeIndividualRemoveFailed
source: The selected badge could not be removed
pt_br: Não foi possível remover a badge selecionada

# MediaBadgeIndividualRemoved
source: Custom badge removed; the other variant or the default will be used as fallback
pt_br: Badge personalizada removida; a outra variante ou a padrão será usada como fallback

# MediaBadgeIndividualNothingToRemove
source: No custom image is defined for this selection
pt_br: Nenhuma imagem personalizada definida para essa seleção

# MediaBadgeCustomSetActive
source: Custom set active
pt_br: Conjunto personalizado ativo

# MediaBadgeVariantStateCustom
source: Custom
pt_br: Personalizado

# MediaBadgeVariantStateDefault
source: HC Player default
pt_br: Padrão HC Player

# MediaBadgeVariantStateDark
source: Dark theme
pt_br: Tema escuro

# MediaBadgeVariantStateLight
source: Light theme
pt_br: Tema claro

# SettingsMediaBadgeIndividualNaming.Text
source: Use badge name + Dark/Light; separators are optional. Example: DolbyVision.Dark.png
pt_br: Use nome da badge + Dark/Light; separadores são opcionais. Ex.: DolbyVision.Dark.png

# MediaBadgeFilenameInvalid
source: Unsupported file name. Use, for example, DolbyVision.Dark.png
pt_br: Nome incompatível. Use, por exemplo, DolbyVision.Dark.png

# MediaBadgeFilenameThemeDark
source: Dark theme
pt_br: Tema escuro

# MediaBadgeFilenameThemeLight
source: Light theme
pt_br: Tema claro

# MediaBadgeFilenameImported
source: imported
pt_br: importada

# SettingsProfilesQuickAccessTitle.Text
source: Quick profile access
pt_br: Acesso rápido aos perfis

# SettingsProfilesQuickAccessDescription.Text
source: Shows a button on the control bar for quick access to imported profiles
pt_br: Mostra um botão na barra de controles para acessar os perfis importados

source: Playback profiles
pt_br: Perfis de reprodução

# MainPageProfilesButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Playback profiles
pt_br: Perfis de reprodução

# MainPageDynDeactivateProfile
source: Disable profile
pt_br: Desativar perfil

# SettingsTemporalScalerDisabledHint.Text
source: Available when temporal interpolation is enabled
pt_br: Disponível quando a interpolação temporal estiver ativada

# SettingsDefaultPlayerTitle.Text
source: Default media player
pt_br: Player de mídia padrão

# SettingsDefaultPlayerDescription.Text
source: Open Windows Settings to choose HC Player as the default app for supported media formats
pt_br: Abra as Configurações do Windows para escolher o HC Player como padrão nos formatos compatíveis

# SettingsDefaultPlayerButton.Text
source: Set as default
pt_br: Definir como padrão

# PlaylistHeaderTitle.Text
source: Playback queue
pt_br: Fila de reprodução

# PlaylistHeaderSubtitle.Text
source: Current playlist items
pt_br: Itens atuais da playlist

# PlaylistMoreButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: More queue options
pt_br: Mais opções da fila

# PlaylistAddFolderMenuItem.Text
source: Add folder to queue
pt_br: Adicionar pasta à fila

# PlaylistAddFolderDialogTitle
source: Add folder to queue
pt_br: Adicionar pasta à fila

# PlaylistClearQueueMenuItem.Text
source: Clear queue
pt_br: Limpar fila

# PlaylistCloseButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Close
pt_br: Fechar

# PlaylistEmptyText.Text
source: No items in the queue
pt_br: Nenhum item na fila

# PlaylistEmptyLabel
source: No items in the queue
pt_br: Nenhum item na fila

# PlaylistCurrentLabel
source: Playing
pt_br: Reproduzindo

# PlaylistPausedLabel
source: Paused
pt_br: Pausado

# PlaylistFinishedLabel
source: Finished
pt_br: Concluído

# PlaylistAddButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Add files to queue
pt_br: Adicionar arquivos à fila

# PlaylistAddDialogTitle
source: Add files to queue
pt_br: Adicionar arquivos à fila

# PlaylistReorderLabel
source: Drag to reorder
pt_br: Arrastar para reordenar

# PlaylistRemoveLabel
source: Remove from queue
pt_br: Remover da fila

# PlaylistItemLabel
source: Playlist item
pt_br: Item da playlist

# PlaylistExternalDropText.Text
source: Drop to add to queue
pt_br: Solte para adicionar à fila

# SettingsDyn_96B47888
source: The playback engine is not available to validate the yt-dlp options.
pt_br: O mecanismo de reprodução não está disponível para validar as opções do yt-dlp.

# SettingsDyn_3D6947A0
source: Could not prepare yt-dlp option validation.
pt_br: Não foi possível preparar a validação das opções do yt-dlp.

# SettingsDyn_93009E52
source: The ytdl-raw-options syntax is invalid.
pt_br: A sintaxe de ytdl-raw-options não é válida.

# SettingsDyn_EDD4DDE6
source: Could not initialize yt-dlp option validation.
pt_br: Não foi possível inicializar a validação das opções do yt-dlp.

# SettingsDyn_7BB8D651
source: Could not parse ytdl-raw-options.
pt_br: Não foi possível interpretar ytdl-raw-options.

# SettingsDyn_3A046176
source: yt-dlp is not available to validate the advanced options.
pt_br: O yt-dlp não está disponível para validar as opções avançadas.

# SettingsDyn_BE1272DD
source: Initial volume must be between 0 and 1000.
pt_br: Volume inicial deve estar entre 0 e 1000.

# SettingsDyn_6843134C
source: Volume limit must be between 100 and 1000.
pt_br: Limite de volume deve estar entre 100 e 1000.

# SettingsDyn_0EE5CFAD
source: Initial volume cannot be greater than the volume limit.
pt_br: Volume inicial não pode ser maior que o limite de volume.

# SettingsDyn_65D7ED84
source: Could not prepare the yt-dlp option query.
pt_br: Não foi possível preparar a consulta às opções do yt-dlp.

# SettingsDyn_25B0DDC5
source: Could not run the current yt-dlp to query its options.
pt_br: Não foi possível executar o yt-dlp atual para consultar suas opções.

# SettingsDyn_4F2D0A51
source: Could not query the options supported by the current yt-dlp.
pt_br: Não foi possível consultar as opções suportadas pelo yt-dlp atual.

# SettingsDyn_181680E8
source: The current yt-dlp did not return a recognizable option list.
pt_br: O yt-dlp atual não retornou uma lista de opções reconhecível.

# SettingsDyn_6AB03FEC
source: The current yt-dlp does not recognize the option:
pt_br: O yt-dlp atual não reconhece a opção:

# ContextMenuB129.Text
source: Add external track...
pt_br: Adicionar faixa externa...

# ContextMenuB130.Text
source: Add external subtitle...
pt_br: Adicionar legenda externa...

# PickerExternalAudioFilesFilter
source: Audio files
pt_br: Arquivos de áudio

# PickerExternalSubtitleFilesFilter
source: Subtitle files
pt_br: Arquivos de legenda

# PickerExternalAudioTitle
source: Add external audio track
pt_br: Adicionar faixa de áudio externa

# PickerExternalSubtitleTitle
source: Add external subtitle
pt_br: Adicionar legenda externa

# SettingsResetSection.Text
source: RESET
pt_br: REDEFINIR

# SettingsResetTitle.Text
source: Reset settings
pt_br: Redefinir configurações

# SettingsResetDescription.Text
source: Restores HC Player settings to their default values without deleting your personal files
pt_br: Restaura as configurações do HC Player aos valores padrão sem apagar seus arquivos pessoais

# SettingsResetButton.Text
source: Reset
pt_br: Redefinir

# SettingsResetDialogTitle
source: Reset settings?
pt_br: Redefinir configurações?

# SettingsResetDialogMessage
source: Playback, video, audio, subtitle, interface, streaming, and capture settings will return to their default values. The current theme, fonts, shaders, badges, yt-dlp/Deno, captures, and media files will be preserved. Imported shaders will remain installed but will be disabled. Unsaved changes will be discarded.
pt_br: As configurações de reprodução, vídeo, áudio, legendas, interface, streaming e captura voltarão aos valores padrão. O tema atual, fontes, shaders, badges, yt-dlp/Deno, capturas e arquivos de mídia serão preservados. Shaders importados permanecerão instalados, mas serão desativados. Alterações ainda não salvas serão descartadas.

# SettingsResetDialogPrimary
source: Reset
pt_br: Redefinir

# SettingsResetDialogCancel
source: Cancel
pt_br: Cancelar

# SettingsResetSuccessTitle
source: Settings reset
pt_br: Configurações redefinidas

# SettingsResetSuccessMessage
source: The default values will be used the next time HC Player starts. Restart the app to finish.
pt_br: Os valores padrão serão usados na próxima inicialização do HC Player. Reinicie o aplicativo para concluir.

# SettingsResetFailedTitle
source: Could not reset settings
pt_br: Não foi possível redefinir

# SettingsResetFailedMessage
source: The settings reset could not be completed.
pt_br: Não foi possível concluir a redefinição das configurações.

# SettingsDyn_85E8D934
source: Windows ICC profile
pt_br: Perfil ICC do Windows

# SettingsDyn_79980472
source: Automatically uses the color profile associated with the display for color management during playback
pt_br: Usa automaticamente o perfil de cores associado à tela para o gerenciamento de cor durante a reprodução

# ShortcutAction071.Text
source: Open Media Information
pt_br: Abrir Informações de mídia

# ShortcutAction072.Text
source: Toggle Picture-in-Picture
pt_br: Alternar Picture-in-Picture

# ShortcutAction073.Text
source: Open playback queue
pt_br: Abrir fila de reprodução

# SettingsDyn_3821F60F
source: The D3D11 graphics API requires the d3d11 graphics context.
pt_br: A API gráfica D3D11 requer o contexto gráfico d3d11.

# SettingsDyn_00520177
source: The Vulkan graphics API requires the winvk graphics context on Windows.
pt_br: A API gráfica Vulkan requer o contexto gráfico winvk no Windows.

# SettingsDyn_396B451D
source: The OpenGL graphics API requires the win or angle graphics context on Windows.
pt_br: A API gráfica OpenGL requer o contexto gráfico win ou angle no Windows.

# SettingsDyn_9E222085
source: Direct d3d11va requires the gpu or gpu-next video output.
pt_br: d3d11va direto requer a saída de vídeo gpu ou gpu-next.

# SettingsDyn_711CD492
source: Direct d3d11va requires the d3d11 or angle graphics context.
pt_br: d3d11va direto requer o contexto gráfico d3d11 ou angle.

# SettingsDyn_3D0A33FD
source: The selected tone mapping mode requires the gpu-next video output.
pt_br: O tone mapping selecionado requer a saída de vídeo gpu-next.

# SettingsDyn_66F57DB1
source: target-colorspace-hint=yes requires the gpu-next video output.
pt_br: target-colorspace-hint=yes requer a saída de vídeo gpu-next.

# SettingsDyn_C4176441
source: Direct d3d11va is not compatible with the Vulkan graphics API.
pt_br: d3d11va direto não é compatível com a API gráfica Vulkan.

# SettingsDyn_B9FB35FD
source: Direct d3d11va with OpenGL requires the angle graphics context.
pt_br: d3d11va direto com OpenGL requer o contexto gráfico angle.

# SettingsDyn_2B582943
source: target-colorspace-hint=yes requires the d3d11 or winvk graphics context on Windows.
pt_br: target-colorspace-hint=yes requer contexto gráfico d3d11 ou winvk no Windows.

# SettingsDyn_7E120537
source: The new video configuration could not start the playback engine. The previous configuration was restored.
pt_br: A nova configuração de vídeo não pôde iniciar o mecanismo de reprodução. A configuração anterior foi restaurada.

# SettingsDyn_75A1DFE2
source: The change could not be completed, and the automatic engine rollback also failed. Restart HC Player before continuing.
pt_br: Não foi possível concluir a alteração e a restauração automática do mecanismo também falhou. Reinicie o HC Player antes de continuar.

# SettingsDyn_4A3310A9
source: The new settings could not be saved to disk. The previous configuration was restored.
pt_br: Não foi possível salvar as novas configurações no disco. A configuração anterior foi restaurada.

# SettingsDyn_A9A762B8
source: The change could not be completed, and the automatic rollback could not be completed safely. Restart HC Player before continuing.
pt_br: Não foi possível concluir a alteração e a restauração automática também não foi concluída com segurança. Reinicie o HC Player antes de continuar.

# SettingsTransportStyleTitle.Text
source: Controls style
pt_br: Estilo dos controles

# SettingsTransportStyleDescription.Text
source: Switches between Bar mode and the compact Minimal mode
pt_br: Alterna entre o modo Barra e o modo Mínimo compacto

# SettingsTransportStyleClassic.Content
source: Bar
pt_br: Barra

# SettingsTransportStyleMinimal.Content
source: Minimal
pt_br: Mínimo

# SettingsBarLayoutTitle.Text
source: Bar layout
pt_br: Layout da barra

# SettingsBarLayoutDescription.Text
source: Compact uses two rows; Full preserves the current three-row bar
pt_br: Compacto usa duas linhas; Completo preserva a barra atual de três linhas

# SettingsBarLayoutCompact.Content
source: Compact
pt_br: Compacto

# SettingsBarLayoutFull.Content
source: Full
pt_br: Completo

source: Play/Pause
pt_br: Reproduzir/Pausar

source: Enable repeat
pt_br: Ativar repetição

source: Repeat video
pt_br: Repetir vídeo

source: Playback speed
pt_br: Velocidade de reprodução

source: More controls
pt_br: Mais controles

# MainPageDynMinimalOpenFile
source: Open file
pt_br: Abrir arquivo

# MainPageDynMinimalOpenFolder
source: Open folder
pt_br: Abrir pasta

# MainPageDynMinimalRepeat
source: Repeat
pt_br: Repetir

# MainPageDynMinimalShuffle
source: Shuffle
pt_br: Reprodução aleatória

source: Speed
pt_br: Velocidade

# MainPageDynMinimalProfiles
source: Profiles
pt_br: Perfis

# MainPageDynMinimalMediaInfo
source: Media information
pt_br: Informações de mídia

# MainPageDynMinimalStats
source: Playback statistics
pt_br: Estatísticas de reprodução

# MainPageDynMinimalCapture
source: Screenshot
pt_br: Captura de tela

# MainPageDynMinimalCaptureNoSubtitles
source: Capture without subtitles
pt_br: Capturar sem legendas

# MainPageDynMinimalCaptureWithSubtitles
source: Capture with subtitles
pt_br: Capturar com legendas

# MainPageDynMinimalCaptureFolder
source: Open screenshots folder
pt_br: Abrir pasta de capturas

# MainPageDynMinimalSettings
source: Settings
pt_br: Configurações
